# To find/Set our Working directory

In [3]:
pwd #finding working directory

'C:\\Users\\DELL\\Downloads\\mynumpy'

## OR

In [4]:
import os
os.getcwd() #get current working directory.

'C:\\Users\\DELL\\Downloads\\mynumpy'

In [5]:
#Change directory os.chdir("C:\\Users\\DELL\\Downloads\\mynumpy")

# Importing CSV datafile Using Pandas

In [6]:
import pandas as pd
df=pd.read_csv("C:\\Users\\DELL\\OneDrive\\Documents\\CSV.csv")

In [7]:
df.columns

Index(['Share ', 'Prices', 'rank'], dtype='object')

In [8]:
df[['Share ']]

             Share
0       Tata motors
1          Reliance
2             Bajaj
3   Jain Irrigation
4               TCS
5            Zensar
6              Ford
7            Goggle
8             Tesla
9         Microsoft
10            Apple
11              NaN
12             Oppo
13           Amazon
14              TCS

In [9]:
df

             Share     Prices  rank
0       Tata motors    1121.0   1.0
1          Reliance    2000.0   2.0
2             Bajaj    4500.0   3.0
3   Jain Irrigation      25.0   4.0
4               TCS    2100.0   5.0
5            Zensar     250.0   6.0
6              Ford    8000.0   7.0
7            Goggle   50000.0   8.0
8             Tesla   10000.0   9.0
9         Microsoft  150000.0  10.0
10            Apple   15000.0  11.0
11              NaN       NaN   NaN
12             Oppo    1008.0  13.0
13           Amazon   15000.0  14.0
14              TCS    1344.0  15.0

In [10]:
t=df["Prices"].max()
print(t)

150000.0

In [11]:
df["Prices"].mean()

18596.285714285714

# OR

In [12]:
t=df["Prices"]
print(t.max())
print(t.mean())

150000.0
18596.285714285714

In [13]:
import pandas as pd
df1=pd.read_csv("C:\\Users\\DELL\\OneDrive\\Desktop\Sample_data.csv")

# Accessing Rows from DataFrame

In [14]:
df1.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,28-05-2010,669165933,27-06-2010,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,22-08-2012,963881480,15-09-2012,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,02-05-2014,341417157,08-05-2014,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,20-06-2014,514321792,05-07-2014,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,01-02-2013,115456712,06-02-2013,5062,651.21,524.96,3296425.02,2657347.52,639077.50

In [15]:

df1.tail(2) #Argument passed gives no. of rows as passed argument (here it is 2)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
98,North America,Mexico,Personal Care,Offline,M,30-07-2015,559427106,08-08-2015,5767,81.73,56.67,471336.91,326815.89,144521.02
99,Sub-Saharan Africa,Mozambique,Household,Offline,L,10-02-2012,665095412,15-02-2012,5367,668.27,502.54,3586605.09,2697132.18,889472.91

In [16]:
df1[45:50]

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
45,Sub-Saharan Africa,Comoros,Cereal,Offline,H,29-03-2016,902102267,29-04-2016,962,205.70,117.11,197883.40,112659.82,85223.58
46,Europe,Iceland,Cosmetics,Online,C,31-12-2016,331438481,31-12-2016,8867,437.20,263.33,3876652.40,2334947.11,1541705.29
47,Europe,Switzerland,Personal Care,Online,M,23-12-2010,617667090,31-01-2011,273,81.73,56.67,22312.29,15470.91,6841.38
48,Europe,Macedonia,Clothes,Offline,C,14-10-2014,787399423,14-11-2014,7842,109.28,35.84,856973.76,281057.28,575916.48
49,Sub-Saharan Africa,Mauritania,Office Supplies,Offline,C,11-01-2012,837559306,13-01-2012,1266,651.21,524.96,824431.86,664599.36,159832.50

In [17]:
df1.shape  #shape is tuple which gives numbers dimentions in the gives arry

(100, 14)

In [18]:
rows,columns = df1.shape #we just assign the values of 100 to rows and 14 to columns

In [19]:
rows

100

In [20]:
columns

14

In [21]:
df1.columns

Index(['Region', 'Country', 'Item Type', 'Sales Channel', 'Order Priority',
       'Order Date', 'Order ID', 'Ship Date', 'Units Sold', 'Unit Price',
       'Unit Cost', 'Total Revenue', 'Total Cost', 'Total Profit'],
      dtype='object')

# Columns Accessing from DataFrame

In [22]:
df1[['Country','Item Type']]

                  Country        Item Type
0                  Tuvalu        Baby Food
1                 Grenada           Cereal
2                  Russia  Office Supplies
3   Sao Tome and Principe           Fruits
4                  Rwanda  Office Supplies
..                    ...              ...
95                   Mali          Clothes
96               Malaysia           Fruits
97           Sierra Leone       Vegetables
98                 Mexico    Personal Care
99             Mozambique        Household

[100 rows x 2 columns]

In [23]:
df1['Unit Price'].max()

668.27

In [24]:
df1['Unit Price'].mean()

276.76130000000006

In [25]:
df1['Unit Price'].std()

235.59224058433128

In [26]:
df1['Unit Price'].describe()

count    100.000000
mean     276.761300
std      235.592241
min        9.330000
25%       81.730000
50%      179.880000
75%      437.200000
max      668.270000
Name: Unit Price, dtype: float64

# Accesing rows for  Condition of Perticular column.

In [27]:
df1[df1['Unit Price']>668] #print the rows where unit prices are greater than 650

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
6,Sub-Saharan Africa,Angola,Household,Offline,M,23-04-2011,135425221,27-04-2011,4187,668.27,502.54,2798046.49,2104134.98,693911.51
13,Central America and the Caribbean,Honduras,Household,Offline,H,08-02-2017,522840487,13-02-2017,8974,668.27,502.54,5997054.98,4509793.96,1487261.02
18,Asia,Turkmenistan,Household,Offline,L,30-12-2010,441619336,20-01-2011,3830,668.27,502.54,2559474.10,1924728.20,634745.90
29,Sub-Saharan Africa,The Gambia,Household,Offline,L,26-05-2012,886494815,09-06-2012,2370,668.27,502.54,1583799.90,1191019.80,392780.10
33,Asia,Myanmar,Household,Offline,H,16-01-2015,177713572,01-03-2015,8250,668.27,502.54,5513227.50,4145955.00,1367272.50
58,Europe,United Kingdom,Household,Online,L,05-01-2012,955357205,14-02-2012,282,668.27,502.54,188452.14,141716.28,46735.86
75,North America,Mexico,Household,Offline,C,06-11-2014,986435210,12-12-2014,6954,668.27,502.54,4647149.58,3494663.16,1152486.42
80,Europe,Spain,Household,Offline,L,21-10-2012,213487374,30-11-2012,4513,668.27,502.54,3015902.51,2267963.02,747939.49
99,Sub-Saharan Africa,Mozambique,Household,Offline,L,10-02-2012,665095412,15-02-2012,5367,668.27,502.54,3586605.09,2697132.18,889472.91

In [28]:
df1[df1['Unit Price']==df1['Unit Price'].max()]

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
6,Sub-Saharan Africa,Angola,Household,Offline,M,23-04-2011,135425221,27-04-2011,4187,668.27,502.54,2798046.49,2104134.98,693911.51
13,Central America and the Caribbean,Honduras,Household,Offline,H,08-02-2017,522840487,13-02-2017,8974,668.27,502.54,5997054.98,4509793.96,1487261.02
18,Asia,Turkmenistan,Household,Offline,L,30-12-2010,441619336,20-01-2011,3830,668.27,502.54,2559474.10,1924728.20,634745.90
29,Sub-Saharan Africa,The Gambia,Household,Offline,L,26-05-2012,886494815,09-06-2012,2370,668.27,502.54,1583799.90,1191019.80,392780.10
33,Asia,Myanmar,Household,Offline,H,16-01-2015,177713572,01-03-2015,8250,668.27,502.54,5513227.50,4145955.00,1367272.50
58,Europe,United Kingdom,Household,Online,L,05-01-2012,955357205,14-02-2012,282,668.27,502.54,188452.14,141716.28,46735.86
75,North America,Mexico,Household,Offline,C,06-11-2014,986435210,12-12-2014,6954,668.27,502.54,4647149.58,3494663.16,1152486.42
80,Europe,Spain,Household,Offline,L,21-10-2012,213487374,30-11-2012,4513,668.27,502.54,3015902.51,2267963.02,747939.49
99,Sub-Saharan Africa,Mozambique,Household,Offline,L,10-02-2012,665095412,15-02-2012,5367,668.27,502.54,3586605.09,2697132.18,889472.91

In [ ]:
df1[df1['Country']=='Spain']

# We can also make data frame as follows

In [1]:
import pandas as pd
data={
    'days':['monday','tuesday','wed','thursday','friday','saturday','sunday'],
    'working hours':[6,8,9,2,1,10,7],
    'Gender':['M','F','M','M','M','F','F']    
}
df2=pd.DataFrame(data)
df2

       days  working hours Gender
0    monday              6      M
1   tuesday              8      F
2       wed              9      M
3  thursday              2      M
4    friday              1      M
5  saturday             10      F
6    sunday              7      F

In [3]:
df2.to_csv('data_new.csv')

In [ ]:
df2[df2['working hours']<=3]

# Importing Excel file(xlsx) file Using Pandas

#### syntax:pd.read_excel(r"path of file.xlsx","sheet name" )

#### r: for read mode

In [ ]:
import pandas as pd
df3=pd.read_excel("C:\\Users\\DELL\\OneDrive\\Documents\\Tutorial10.xlsx","Statistics Function") 
df3

# Read \ Write CSV

In [ ]:
dframe=pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Sample_data-DESKTOP-H49BBNK.csv")

In [ ]:
dframe.head(3)

In [ ]:
d=pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Book2.csv")

In [ ]:
d

In [ ]:
import pandas as pd
d=pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Book2.csv")
d

## When you want to skips rows in the data frame while reading data frame.

In [ ]:
d=pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Book2.csv",skiprows=1)

In [ ]:
d

# To Remove headers of the DataFrame`

In [ ]:
d=pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Book2.csv",skiprows=1,header=None)

In [ ]:
d.head()

# To give the names to headers`

In [ ]:
import pandas as pd
d=pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Book2.csv",names=['Friends','Special days','Remarks'],nrows=2 )
d
#nrows=2 :for printing two rows of data frame.

# Convert missing values Or dissatisfactary values to the NaN for whole data

In [ ]:
d1=pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Book2.csv")
d=pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Book2.csv",na_values=['n.a.',-99999,-88888]) #converted "Snow and 12 into NaN"
pd.concat([d1,d],axis=1)
#We can check the changes in the dataframes after using na_values.

# Convert missing values Or dissatisfactary values to the NaN for perticuler column

In [ ]:
d.columns #Tip: while performing action on columns necessary to access names of all columns.

In [ ]:

d=pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Book2.csv",na_values={
    'Days': ['n.a.','Sun'],
    'Name ':['n.a.','Nikita']
})
d

# Write CSV

In [ ]:
d.to_csv('new.csv') #It will save in the working directory :-   'C:\\Users\\DELL\\Downloads\\mynumpy'

In [ ]:
pwd #to get path of the working Directory.

## to remove index

In [ ]:
d.to_csv("new.csv",index=False)

In [ ]:
d.columns

In [ ]:
d.to_csv("new1.csv",columns=['Name ', 'Days']) #Only two columns will save in the file.

# Write Excel

In [ ]:
data=pd.read_excel(r"C:\Users\DELL\Downloads\file.xlsx")
data

# Modifying and writing Excel

In [ ]:
data.columns

In [ ]:
def convert_empid(cell):
    if cell==10:
        return "change"
    return cell
def convert_name(cell):
    if cell=='ABC':
        return 'Saggy'
    return(cell)
data=pd.read_excel(r"C:\Users\DELL\Downloads\file.xlsx",converters={
    "NAME":convert_name,
    "EMPID":convert_empid
    
})
data

In [ ]:
data.to_excel("new.xlsx",sheet_name='Employees',startrow=1,startcol=3) #change sheet name and start dataframe from row1 and col3

In [ ]:
pd.read_excel("new.xlsx") #above operation we can observed in the data.

## Two data frames save(Write) in one file and in different Sheets

In [ ]:
with pd.Excelwriter('Stock_Employee.xlsx'):
    df3.to_excel(Excelwriter,sheet_name='Stock')
    dframe.to_excel(Excelwriter,sheet_name='Employee')

# 1)fillna to fill missing values using different ways

In [ ]:
D=pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Book2.csv")
D
t=D.Day[0]#To Access Perticular Element from perticuler column
print(t)
type(t)

In [ ]:
D.head(2)

## to change the data type of the Day column from str to date .

In [ ]:
D=pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Book2.csv",parse_dates=['Day'])

In [ ]:
type(D.Day[0] )

## To change the index as date column

In [ ]:
D.set_index('Day',inplace=True)
D

In [ ]:
new=D.fillna(0) #Fill the NaN values by 0
new

In [ ]:
new.columns

In [ ]:
new_df=D.fillna({
    'Temperature':0,
    'whindspeed':0,
   'event':'Holiday'
    
})
new_df

In [ ]:
new_df['Temperature'].mean()

In [ ]:
new_df["whindspeed"].mean()

# Row wise Carry forward values

## # To carry forward previous Row value to the next Row value

In [ ]:
new_df=D.fillna(method='ffill') #ffill:forward fill
new_df

## # To carry next Row value to the previous Row value

In [ ]:
import pandas as pd
D=pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Book2.csv",parse_dates=['Day'])
new_df=D.fillna(method='bfill')
new_df

In [ ]:
new_df['Temperature'].mean()

# Column wise carry forward Values

In [ ]:
## # To carry next column value to the previous column value

In [ ]:
D=pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Book2.csv",parse_dates=['Day'])
D

In [ ]:
new_df=D.fillna(method='ffill',axis='columns')
new_df

In [ ]:
new_df=D.fillna(method='ffill',limit=1) #perticular value forward for limit one times

new_df

In [ ]:
new_df=D.fillna(method='ffill') 
new_df

# 2)Interpolate to make guess on missing values using interpolation

## To fill Interpolated valued for NaN values use interpolate() function

In [ ]:
dfr=D.interpolate()
dfr

# To skip the rows have NaN values use dropna() function

In [ ]:
D.dropna()

# 3)dropna to drop rows with missing values

## Drop the rows have all cells are empty

In [ ]:
F=pd.read_csv(r"C:\Users\DELL\OneDrive\Documents\CSV.csv")

In [ ]:
F

In [ ]:
F1=F.dropna(how='all') #in the F dataframe row no.11 have all the data is empty so we drop it
F1

In [ ]:
D=pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Book2.csv",parse_dates=['Day'])
D.set_index('Day',inplace=True)
D

## If At least one valid value (NO NaN value) then dont drop the row

In [ ]:
D.dropna(thresh=1)
D

##  If At least two valid value (NO NaN value) then dont drop the row

In [ ]:
ne=D.dropna(thresh=2)
ne

In [ ]:
D.columns

In [ ]:
D=pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Book2.csv",parse_dates=['Day'])
new=D.fillna({'event':'Holiday',
          'Temperature':-99999,
          'whindspeed':-99999
         })

In [ ]:
new

In [ ]:
import pandas as pd
import numpy as np

# Replace Values in the Data Frame.

In [ ]:
new2=new.replace(-99999,np.NaN)
new2

In [ ]:
new2=new2.fillna({'event':'Holiday',
          'Temperature':-88888,
          'whindspeed':-99999
         })
new2

In [ ]:
new=new2.replace([-99999,-88888],np.NaN)
new

# Replace Values base on Specific columns

In [ ]:
new=new2.replace({'event':'Holiday',
          'Temperature':-88888,
          'whindspeed':-99999
         },np.NaN)
new

In [ ]:
new2=new2.fillna({'event':'Holiday',
          'Temperature':-88888,
          'whindspeed':-99999
         })
new2

# Replace Specific value

In [ ]:
new=new2.replace({
    -88888:np.NaN,
    'Holiday':"Sunny"
    
})
new

In [ ]:
new2=new2.fillna({'event':'Holiday',
          'Temperature':-88888,
          'whindspeed':-99999
         })
new2

# Replace Character/Units from data.

In [ ]:
import pandas as pd
f=pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Book2.csv")
f

In [ ]:
new_df=f.replace('[A-Za-z]','',regex=True) #Replaced the units with empty space : F and mph
new_df

### But event column aslo replaced so we dont want to do this we use dictionary.

In [ ]:
f.columns

In [ ]:
new_def=f.replace({
    'Temperature':'[A-Za-z]',
    'whindspeed':'[A-Za-z]',
    
},'',regex=True)
new_def

In [ ]:
df=pd.DataFrame({
    'score':['exeptional','average','good','poor','average','exeptional'],
    'student':['chetan','pradip','nikita','komal','diksha','nishant']
    
})
df

In [ ]:
print(Out[14])

In [ ]:
new=df.replace(['poor','average','good','exeptional'],[1,2,3,4])
new

In [ ]:
import pandas as pd
weather=pd.read_csv(r"weather.csv")

In [ ]:
weather.head()

In [ ]:
print(weather['Date.Full'][0])
type(weather['Date.Full'][0])

In [ ]:
new=pd.read_csv(r"weather.csv",parse_dates=['Date.Full'])
new.head()

In [ ]:
type(new['Date.Full'][0])

In [ ]:

weather.columns

#### To Take Sample Data from big Weather data(taken few columns)

In [ ]:
f=weather.to_csv("Wsample",columns=['Date.Year','Station.City','Data.Temperature.Max Temp','Data.Temperature.Min Temp','Station.Code'],index=False)

In [ ]:
new1=pd.read_csv(r"Wsample")
new1.head()

#### Let change the columns names

In [ ]:
new1=pd.read_csv(r"Wsample",names=['Year','City','Temp','windspeed','event'])
new1.columns

In [ ]:
new1.head()

# Group by Split and Combine

## City wise split the data in different Classes.

In [ ]:
g=new1.groupby("City")
g

In [ ]:
for City, City_new1 in g:
    print(City)
    print(City_new1)

# To Aceess perticular group

### group might be massive so we are accessing some of the head values.

In [ ]:
g.get_group('Aberdeen').head()

In [ ]:
g.get_group('Alpena').head()

### Q.what is max temperature of each city

In [ ]:
g.min().head()

In [ ]:
g.describe()


# Concatanation of the DataFrames

In [ ]:
import pandas as pd
india_weather=pd.DataFrame({
    'city':['mumbai','delhi','banglore'],
    'temperature':[32,45,33],
    'humidity':[80,60,75]
})
india_weather

In [ ]:
us_weather=pd.DataFrame({
    'city':['new york','chicago','orlando'],
    'temperature':[21,14,35],
    'humidity':[68,65,75]
})
us_weather

In [ ]:
df=pd.concat([india_weather,us_weather])
df

#### To sequence index we wont take as it is index from dataframes we ignore it and bydefault jupyter will take index with proper seq

In [ ]:
df=pd.concat([india_weather,us_weather],ignore_index=True)
df

In [ ]:
df=pd.concat([india_weather,us_weather],keys=['india','us'])
df

In [ ]:
df.loc['india']

In [ ]:
df.loc['us']

# Concat columnwise

In [ ]:
df=pd.concat([india_weather,us_weather],axis=1)
df
df.columns

In [ ]:
s=pd.Series(['Humid','dry','rain'],name='event')
s

In [ ]:
df=pd.DataFrame([india_weather,s])
df

In [ ]:
f=lambda x:x*x
import numpy as np

In [ ]:
df['humidity']

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv("new.csv")
df.head()

In [ ]:
df1=pd.DataFrame({'Name ':['Kanchan'],'Days':['Sun'],'Number':[100]})

In [ ]:
df1

In [ ]:
df.columns

In [ ]:
df2=pd.concat([df1,df]).reset_index(drop=True)

In [ ]:
df2.head()

In [ ]:
NCR(3,2)

In [ ]:
def fact(n):
    f=1
    for i in range(n):
        f=f*i